Revit 2027 API
ElectricalSetting.CircuitNamePhaseA Property
 Circuit Naming by Phase - Phase A Label.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string CircuitNamePhaseA { get; set; }
Public Property CircuitNamePhaseA As String
	Get
	Set
public:
property String^ CircuitNamePhaseA {
	String^ get ();
	void set (String^ value);
}
member CircuitNamePhaseA : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace